/*
Необходимо выполнить в отдельном JS файле, подключенному к отдельной HTML странице
1) Создать переменную num со значением 266219 (тип данных число)
2) Вывести в консоль произведение (умножение) цифр этого числа
Например: число 123, при помощи javaScript получить каждую цифру ( 1, 2, 3 ) и перемножить их.
Правильно использовать цикл или методы перебора.
3) Полученный результат возвести в степень 3, используя только 1 оператор (Math.pow не подходит)
4) Вывести в консоль первые 2 цифры полученного числа
5) В отдельном репозитории для усложненных уроков, добавить папку или ветку со вторым уроком в свой репозиторий на GitHub
*/
// alert ('hello');
let num = 266219;
let num1 = num;
let p = 1;
let p1 = num % 10;

while ( p1 >= 1 ) {
  p *= p1;
  num1 = Math.trunc(num1/10);
  console.log('num1: ', num1);
  p1 = num1 % 10;
}

console.log('Произведение цифр числа ' + num + ' равно: ', p);