/*
1) Создайте функцию, которая принимает 1 аргумент (название произвольное)
— Если в качестве аргумента передана не строка - функция оповещает об этом пользователя
— В полученной (как аргумент) строке функция должна убрать все пробелы в начале и в конце
— Если строка более 30 знаков - то после 30го символа часть текста скрывается и вместо них появляются три точки (...)
2) Запушить проект в репозиторий для усложненных заданий на GitHub
*/

'use strict';

const lesson04 = function (arg) {
  
  if (typeof arg === 'string') {
    // В полученной (как аргумент) строке функция должна убрать все пробелы в начале и в конце
    let str1 = arg.trim();
    // Если строка более 30 знаков - то после 30го символа часть текста скрывается 
    // и вместо них появляются три точки (...)
    if (str1.length > 30) {
      return str1.substring(0, 30) + '...';
    }
    return str1;
  } else {
    // Если в качестве аргумента передана не строка - функция оповещает об этом пользователя
    return 'в качестве аргумента передана не строка';
  }
};

console.log(lesson04('1234567890123456789012345678901234567890'));